app/views/home/index.html.erb

<label>Auto Number:  </label>
<%= select_tag :auto_number, options_from_collection_for_select(Auto.all, :number, :number, params[:auto_number]),:prompt => "Please select" %>&nbsp;&nbsp;
---
SELECT `autos`.* FROM `autos`

<label>From:  </label>
<%= select_tag :source, options_from_collection_for_select(Source.all, :name, :name, params[:source_name]),:prompt => "Please select" %>&nbsp;&nbsp;
---
SELECT `sources`.* FROM `sources`

<label>To:  </label>
<%= select_tag :destination, options_from_collection_for_select(Destination.all, :name, :name, params[:destination_name]), :prompt => "Please select" %>&nbsp;&nbsp;
---
SELECT `destinations`.* FROM `destinations`